WebServices1/result1/Iteration3/t1_http.xml

<?xml-stylesheet href="..\http.xsl" type="text/xsl"?>
<report vuGenInstallDir="C:\Program Files (x86)\Micro Focus\LoadRunner\">
  <http>
    <request>
      <header>POST /axis2/services/BLZService HTTP/1.1
Content-Type: text/xml; charset=utf-8; action=""
Cache-Control: no-cache
SOAPAction: ""
User-Agent: Mozilla/4.0 (compatible; MSIE 6.0; MS Web Services Client Protocol 1.1.4322.2032)
Accept-Encoding: gzip, deflate
Accept: */*
Connection: Keep-Alive
Host: www.thomas-bayer.com
Content-Length: 221

</header>
      <body>&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s:Body&gt;
    &lt;getBank xmlns="http://thomas-bayer.com/blz/" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;
      &lt;blz&gt;61150025&lt;/blz&gt;
    &lt;/getBank&gt;
  &lt;/s:Body&gt;
&lt;/s:Envelope&gt;</body>
    </request>
    <response>
      <header>HTTP/1.1 500 Internal Server Error
Server: Apache-Coyote/1.1
Content-Type: text/xml;charset=utf-8
Date: Mon, 13 Dec 2021 05:52:51 GMT
Connection: close
Content-Length: 2621

</header>
      <body>&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;soapenv:Body&gt;
    &lt;soapenv:Fault&gt;
      &lt;faultcode&gt;soapenv:Server&lt;/faultcode&gt;
      &lt;faultstring&gt;Keine Bank zur BLZ 61150025 gefunden!&lt;/faultstring&gt;
      &lt;detail&gt;
        &lt;Exception&gt;org.apache.axis2.AxisFault: Keine Bank zur BLZ 61150025 gefunden!
	at com.thomas_bayer.blz.BLZService.getBank(BLZService.java:41)
	at com.thomas_bayer.blz.BLZServiceMessageReceiverInOut.invokeBusinessLogic(BLZServiceMessageReceiverInOut.java:49)
	at org.apache.axis2.receivers.AbstractInOutSyncMessageReceiver.invokeBusinessLogic(AbstractInOutSyncMessageReceiver.java:42)
	at org.apache.axis2.receivers.AbstractMessageReceiver.receive(AbstractMessageReceiver.java:96)
	at org.apache.axis2.engine.AxisEngine.receive(AxisEngine.java:145)
	at org.apache.axis2.transport.http.HTTPTransportUtils.processHTTPPostRequest(HTTPTransportUtils.java:275)
	at org.apache.axis2.transport.http.AxisServlet.doPost(AxisServlet.java:120)
	at javax.servlet.http.HttpServlet.service(HttpServlet.java:646)
	at javax.servlet.http.HttpServlet.service(HttpServlet.java:727)
	at org.apache.catalina.core.ApplicationFilterChain.internalDoFilter(ApplicationFilterChain.java:303)
	at org.apache.catalina.core.ApplicationFilterChain.doFilter(ApplicationFilterChain.java:208)
	at org.apache.catalina.core.StandardWrapperValve.invoke(StandardWrapperValve.java:220)
	at org.apache.catalina.core.StandardContextValve.invoke(StandardContextValve.java:122)
	at org.apache.catalina.authenticator.AuthenticatorBase.invoke(AuthenticatorBase.java:501)
	at org.apache.catalina.valves.AccessLogValve.invoke(AccessLogValve.java:950)
	at org.apache.catalina.core.StandardHostValve.invoke(StandardHostValve.java:170)
	at org.apache.catalina.valves.ErrorReportValve.invoke(ErrorReportValve.java:98)
	at org.apache.catalina.core.StandardEngineValve.invoke(StandardEngineValve.java:116)
	at org.apache.catalina.valves.RemoteIpValve.invoke(RemoteIpValve.java:683)
	at org.apache.catalina.connector.CoyoteAdapter.service(CoyoteAdapter.java:408)
	at org.apache.coyote.http11.AbstractHttp11Processor.process(AbstractHttp11Processor.java:1041)
	at org.apache.coyote.AbstractProtocol$AbstractConnectionHandler.process(AbstractProtocol.java:607)
	at org.apache.tomcat.util.net.JIoEndpoint$SocketProcessor.run(JIoEndpoint.java:315)
	at java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1145)
	at java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:615)
	at java.lang.Thread.run(Thread.java:745)
&lt;/Exception&gt;
      &lt;/detail&gt;
    &lt;/soapenv:Fault&gt;
  &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;</body>
    </response>
  </http>
</report>